STM-Project/stm32h753/Core/Src/usart.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    usart.c
  * @brief   This file provides code for the configuration
  *          of the USART instances.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "usart.h"

/* USER CODE BEGIN 0 */
#include "mini_printf.h"
#include "_debug.h"
#include "esp32wroom.h"
#include "FreeRTOS.h"
#include "task.h"
//#include "esp32wroom.h"
/* USER CODE END 0 */

UART_HandleTypeDef huart7;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_uart7_rx;
DMA_HandleTypeDef hdma_uart7_tx;
DMA_HandleTypeDef hdma_usart6_rx;
DMA_HandleTypeDef hdma_usart6_tx;

/* UART7 init function */
void MX_UART7_Init(void)
{

  /* USER CODE BEGIN UART7_Init 0 */

  /* USER CODE END UART7_Init 0 */

  /* USER CODE BEGIN UART7_Init 1 */

  /* USER CODE END UART7_Init 1 */
  huart7.Instance = UART7;
  huart7.Init.BaudRate = 2000000;
  huart7.Init.WordLength = UART_WORDLENGTH_8B;
  huart7.Init.StopBits = UART_STOPBITS_1;
  huart7.Init.Parity = UART_PARITY_NONE;
  huart7.Init.Mode = UART_MODE_TX_RX;
  huart7.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart7.Init.OverSampling = UART_OVERSAMPLING_16;
  huart7.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart7.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart7.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart7) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart7, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart7, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart7) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN UART7_Init 2 */

  __HAL_UART_DISABLE_IT(&huart7, UART_IT_TXE | UART_IT_RXNE | UART_IT_TC);			/* 1. WYŁĄCZ niepotrzebne przerwania i WYCZYŚĆ flagi (Przygotowanie pola) */
  __HAL_UART_CLEAR_FLAG(&huart7, UART_FLAG_TC | UART_FLAG_RTOF);
  __HAL_DMA_DISABLE_IT(huart7.hdmatx, DMA_IT_HT);

  HAL_UART_ReceiverTimeout_Config(&huart7, 35); 									/* 2. SKONFIGURUJ parametry sprzętowe,   exmple: timeout for 3.5 bytes idle (10 bytes for one frame) and TimeoutValue=35 */
  HAL_UART_EnableReceiverTimeout(&huart7);

  __HAL_UART_ENABLE_IT(&huart7, UART_IT_RTO);										/* 3. WŁĄCZ docelowe przerwania i teraz (lub pozniej) mozesz WYSTARTOWAC DMA */

  /* USER CODE END UART7_Init 2 */

}
/* USART6 init function */

void MX_USART6_UART_Init(void)
{

  /* USER CODE BEGIN USART6_Init 0 */

  /* USER CODE END USART6_Init 0 */

  /* USER CODE BEGIN USART6_Init 1 */

  /* USER CODE END USART6_Init 1 */
  huart6.Instance = USART6;
  huart6.Init.BaudRate = 115200;
  huart6.Init.WordLength = UART_WORDLENGTH_8B;
  huart6.Init.StopBits = UART_STOPBITS_1;
  huart6.Init.Parity = UART_PARITY_NONE;
  huart6.Init.Mode = UART_MODE_TX_RX;
  huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart6.Init.OverSampling = UART_OVERSAMPLING_16;
  huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart6.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_SWAP_INIT;
  huart6.AdvancedInit.Swap = UART_ADVFEATURE_SWAP_ENABLE;
  if (HAL_UART_Init(&huart6) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart6, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)		//Sprobowac z FIFIO enable !!!!!
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart6, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart6) != HAL_OK)		/* Dzięki FIFO masz pewność, że w momencie wywołania przerwania RTO, absolutnie wszystkie bajty wysłane przez drugie urządzenie zostały bezpiecznie odebrane sprzętowo i albo już są w RAM-ie (dzięki DMA), albo bezpiecznie czekają w kolejce FIFO na zwolnienie szyny przez DMA.*/
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART6_Init 2 */

  __HAL_UART_DISABLE_IT(&huart6, UART_IT_TXE | UART_IT_RXNE | UART_IT_TC);			/* 1. WYŁĄCZ niepotrzebne przerwania i WYCZYŚĆ flagi (Przygotowanie pola) */
  __HAL_UART_CLEAR_FLAG(&huart6, UART_FLAG_TC | UART_FLAG_RTOF);
  __HAL_DMA_DISABLE_IT(huart6.hdmatx, DMA_IT_HT);

  HAL_UART_ReceiverTimeout_Config(&huart6, 35); 									/* 2. SKONFIGURUJ parametry sprzętowe,   exmple: timeout for 3.5 bytes idle (10 bytes for one frame) and TimeoutValue=35 */
  HAL_UART_EnableReceiverTimeout(&huart6);

  __HAL_UART_ENABLE_IT(&huart6, UART_IT_RTO);										/* 3. WŁĄCZ docelowe przerwania i teraz (lub pozniej) mozesz WYSTARTOWAC DMA */

  /* USER CODE END USART6_Init 2 */

}

void HAL_UART_MspInit(UART_HandleTypeDef* uartHandle)
{

  GPIO_InitTypeDef GPIO_InitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
  if(uartHandle->Instance==UART7)
  {
  /* USER CODE BEGIN UART7_MspInit 0 */

  /* USER CODE END UART7_MspInit 0 */

  /** Initializes the peripherals clock
  */
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_UART7;
    PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    /* UART7 clock enable */
    __HAL_RCC_UART7_CLK_ENABLE();

    __HAL_RCC_GPIOF_CLK_ENABLE();
    /**UART7 GPIO Configuration
    PF6     ------> UART7_RX
    PF7     ------> UART7_TX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_UART7;
    HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_UART7;
    HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

    /* UART7 DMA Init */
    /* UART7_RX Init */
    hdma_uart7_rx.Instance = DMA1_Stream2;
    hdma_uart7_rx.Init.Request = DMA_REQUEST_UART7_RX;
    hdma_uart7_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_uart7_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_uart7_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_uart7_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_uart7_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_uart7_rx.Init.Mode = DMA_NORMAL;
    hdma_uart7_rx.Init.Priority = DMA_PRIORITY_LOW;
    hdma_uart7_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_uart7_rx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(uartHandle,hdmarx,hdma_uart7_rx);

    /* UART7_TX Init */
    hdma_uart7_tx.Instance = DMA1_Stream3;
    hdma_uart7_tx.Init.Request = DMA_REQUEST_UART7_TX;
    hdma_uart7_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_uart7_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_uart7_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_uart7_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_uart7_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_uart7_tx.Init.Mode = DMA_NORMAL;
    hdma_uart7_tx.Init.Priority = DMA_PRIORITY_LOW;
    hdma_uart7_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_uart7_tx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(uartHandle,hdmatx,hdma_uart7_tx);

    /* UART7 interrupt Init */
    HAL_NVIC_SetPriority(UART7_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(UART7_IRQn);
  /* USER CODE BEGIN UART7_MspInit 1 */

  /* USER CODE END UART7_MspInit 1 */
  }
  else if(uartHandle->Instance==USART6)
  {
  /* USER CODE BEGIN USART6_MspInit 0 */

  /* USER CODE END USART6_MspInit 0 */

  /** Initializes the peripherals clock
  */
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART6;
    PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    /* USART6 clock enable */
    __HAL_RCC_USART6_CLK_ENABLE();

    __HAL_RCC_GPIOC_CLK_ENABLE();
    /**USART6 GPIO Configuration
    PC6     ------> USART6_TX
    PC7     ------> USART6_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART6;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART6;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    /* USART6 DMA Init */
    /* USART6_RX Init */
    hdma_usart6_rx.Instance = DMA1_Stream0;
    hdma_usart6_rx.Init.Request = DMA_REQUEST_USART6_RX;
    hdma_usart6_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_usart6_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart6_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart6_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart6_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_usart6_rx.Init.Mode = DMA_NORMAL;
    hdma_usart6_rx.Init.Priority = DMA_PRIORITY_LOW;
    hdma_usart6_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_usart6_rx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(uartHandle,hdmarx,hdma_usart6_rx);

    /* USART6_TX Init */
    hdma_usart6_tx.Instance = DMA1_Stream1;
    hdma_usart6_tx.Init.Request = DMA_REQUEST_USART6_TX;
    hdma_usart6_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_usart6_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart6_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart6_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart6_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_usart6_tx.Init.Mode = DMA_NORMAL;
    hdma_usart6_tx.Init.Priority = DMA_PRIORITY_LOW;
    hdma_usart6_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_usart6_tx) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(uartHandle,hdmatx,hdma_usart6_tx);

    /* USART6 interrupt Init */
    HAL_NVIC_SetPriority(USART6_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(USART6_IRQn);
  /* USER CODE BEGIN USART6_MspInit 1 */

  /* USER CODE END USART6_MspInit 1 */
  }
}

void HAL_UART_MspDeInit(UART_HandleTypeDef* uartHandle)
{

  if(uartHandle->Instance==UART7)
  {
  /* USER CODE BEGIN UART7_MspDeInit 0 */

  /* USER CODE END UART7_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_UART7_CLK_DISABLE();

    /**UART7 GPIO Configuration
    PF6     ------> UART7_RX
    PF7     ------> UART7_TX
    */
    HAL_GPIO_DeInit(GPIOF, GPIO_PIN_6|GPIO_PIN_7);

    /* UART7 DMA DeInit */
    HAL_DMA_DeInit(uartHandle->hdmarx);
    HAL_DMA_DeInit(uartHandle->hdmatx);

    /* UART7 interrupt Deinit */
    HAL_NVIC_DisableIRQ(UART7_IRQn);
  /* USER CODE BEGIN UART7_MspDeInit 1 */

  /* USER CODE END UART7_MspDeInit 1 */
  }
  else if(uartHandle->Instance==USART6)
  {
  /* USER CODE BEGIN USART6_MspDeInit 0 */

  /* USER CODE END USART6_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_USART6_CLK_DISABLE();

    /**USART6 GPIO Configuration
    PC6     ------> USART6_TX
    PC7     ------> USART6_RX
    */
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_6|GPIO_PIN_7);

    /* USART6 DMA DeInit */
    HAL_DMA_DeInit(uartHandle->hdmarx);
    HAL_DMA_DeInit(uartHandle->hdmatx);

    /* USART6 interrupt Deinit */
    HAL_NVIC_DisableIRQ(USART6_IRQn);
  /* USER CODE BEGIN USART6_MspDeInit 1 */

  /* USER CODE END USART6_MspDeInit 1 */
  }
}

/* USER CODE BEGIN 1 */
void UART_ClearFlags(UART_HandleTypeDef *huart)
{
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF | UART_CLEAR_PEF | UART_CLEAR_OREF | UART_CLEAR_NEF);		/* Czyścimy flagi błędów, które mogą blokować przerwanie i callback */
/*	__HAL_UART_CLEAR_FEFLAG(huart);
	__HAL_UART_CLEAR_PEFLAG(huart);
	__HAL_UART_CLEAR_OREFLAG(huart);
	__HAL_UART_CLEAR_NEFLAG(huart);
*/
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_IDLEF | UART_CLEAR_RTOF);										/* Czyścimy flagę bezczynności i timeoutu */
	__HAL_UART_FLUSH_DRREGISTER(huart);																		/* Czyścimy FIFO */
	__HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);  												/* Całkowicie czyści sprzętową kolejkę odbiorczą, zapobiegając przetwarzaniu "śmieciowych" bajtów po błędzie */

}

void UART_ClearFlags2(UART_HandleTypeDef *huart)
{
	__HAL_DMA_DISABLE_IT(huart->hdmarx, DMA_IT_HT);				/* HAL_UART_Receive_DMA() automatycznie włącza oba te przerwania i mogą być zbędne i generować niepotrzebne obciążenie procesora */
	__HAL_DMA_DISABLE_IT(huart->hdmarx, DMA_IT_TC);
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance==UART7)
	{
		DBG_EndSendInterrupt();
		DBG_EndSendInterruptQue();
	}
	else if(huart->Instance==USART6)
	{
		asm("nop");
	}
}

void HAL_UARTEx_RxEventCallback_(UART_HandleTypeDef *huart, uint16_t size, long *pxWoken)			/* Obsługa bezczynności (może to być IDLE lub RTO) */
{  																									/* Nie jest samoczynnie wywolywany trzeba samemu wywolac */
	if (huart->Instance == USART6)
	{
		ESP32_Notify2EspThread(0,size,pxWoken);

/*		HAL_UART_RxEventTypeTypeDef eventType = HAL_UARTEx_GetRxEventType(huart);
		switch(eventType)
		{
			case HAL_UART_RXEVENT_IDLE:
				break;

			case HAL_UART_RXEVENT_HT:
				break;

			case HAL_UART_RXEVENT_TC:
				break;
		}
*/
	}
	else if (huart->Instance == UART7)
	{
		ESP32_Notify2EspThread(1,size,pxWoken);
	}
}

void ESP32_UartHandler(long *pxWoken)
{
	if(__HAL_UART_GET_FLAG(&huart6, UART_FLAG_RTOF) != RESET && __HAL_UART_GET_IT_SOURCE(&huart6, UART_IT_RTO) != RESET)
	{
		__HAL_UART_CLEAR_FLAG(&huart6, UART_FLAG_RTOF);
		HAL_UARTEx_RxEventCallback_(&huart6, __HAL_DMA_GET_COUNTER(huart6.hdmarx), pxWoken);		/* Rejestr COUNTER startuje z wartością, która podana jest w funkcji startującej (np. HAL_UART_Receive_DMA), i zmniejsza się o 1 po każdym odebranym bajcie */
	}
}

void DEBUG_UartHandler(long *pxWoken)
{
	if(__HAL_UART_GET_FLAG(&huart7, UART_FLAG_RTOF) != RESET && __HAL_UART_GET_IT_SOURCE(&huart7, UART_IT_RTO) != RESET)
	{
		__HAL_UART_CLEAR_FLAG(&huart7, UART_FLAG_RTOF);
		HAL_UARTEx_RxEventCallback_(&huart7, __HAL_DMA_GET_COUNTER(huart7.hdmarx), pxWoken);
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance==UART7)   //Przerob aby w przerwaniach byly tylko xTaskNotify do vLog Task !!!!!!!!!!!!!!!!!!
	{
		DEBUG_RxFullBuffService();
	}
	else if(huart->Instance==USART6)
	{
		WIFI_RxCallbackService();
	}
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
//    /* 1. Odczytaj rodzaj błędu (opcjonalnie, np. do diagnostyki) */   TO DAJ JAKO FUNKCJE w _debug.c
//     uint32_t error_code = HAL_UART_GetError(huart);
//
//     /* 2. Zresetuj stan sprzętowy UART i DMA */
//     // Funkcja ta czyści flagi błędów w rejestrach procesora i ustawia stan HAL_UART_STATE_READY,
//     // dzięki czemu peryferium będzie gotowe do ponownego uruchomienia.
//     HAL_UART_Abort_IT(huart);
//
//     /* 3. Powiadom zadanie FreeRTOS o błędzie (odroczenie obsługi) */
//     BaseType_t xHigherPriorityTaskWoken = pdFALSE;
//
//     // Przekazujemy np. powiadomienie (Notification) lub semafor do zadania obsługującego UART
//     // Możesz użyć wartości powiadomienia, aby przekazać kod błędu (error_code)
//     xTaskNotifyFromISR(xUartTaskHandle, error_code, eSetValueWithOverwrite, &xHigherPriorityTaskWoken);
//
//     /* 4. Wymuś przełączenie kontekstu (jeśli zadanie ma wysoki priorytet) */
//     portYIELD_FROM_ISR(xHigherPriorityTaskWoken);




//	void vUartTask(void *pvParameters)  // TO DAJ W vLOGTask !!!!!!!!!!!!!!
//	{
//	    uint32_t notified_value;
//
//	    for(;;)
//	    {
//	        // Czekaj na powiadomienie (zwykłe zakończenie transferu LUB błąd)
//	        if(xTaskNotifyWait(0x00, ULONG_MAX, &notified_value, portMAX_DELAY) == pdTRUE)
//	        {
//	            if(notified_value != 0) // Jeśli wartość jest różna od 0, to mamy błąd UART
//	            {
//	                // Tutaj jesteś w bezpiecznym kontekście zadania!
//	                // MOŻESZ użyć vTaskDelay, jeśli linia potrzebuje czasu na ustabilizowanie
//	                vTaskDelay(pdMS_TO_TICKS(5));
//
//	                // MOŻESZ bezpiecznie wyczyścić cache, jeśli przygotowujesz nowy bufor
//	                SCB_CleanDCache_by_Addr(...);
//
//	                // Restartujesz transmisję po wystąpieniu błędu
//	                HAL_UART_Receive_DMA(&huart1, rx_buffer, BUFFER_SIZE);
//	            }
//	            else
//	            {
//	                // Poprawnie odebrane dane...
//	            }
//	        }
//	    }
//	}





	if(huart->Instance==UART7)
	{
		Dbg(1,"\r\n!! UART7_ERROR !!");
	}
	else if(huart->Instance==USART6)
	{
		//WIFI_UartErrorService();
		Dbg(1,"\r\n!! UART6_ERROR !!");
	}
}

void DEBUG_Send(char *txt){
	/* Take Mutex (in future) */
	while (huart7.gState == HAL_UART_STATE_BUSY_TX) vTaskDelay(2);
	HAL_UART_Transmit(&huart7, (uint8_t*)txt, mini_strlen(txt),300);
	/* Give Mutex (in future) */
}

int DEBUG_SendDma(uint8_t *txt, int size){
 /* SCB_CleanDCache_by_Addr((uint32_t*)dbgSendBuffer, SEND_BUFF_SIZE); */
    SCB_CleanDCache_by_Addr((uint32_t*)txt, CACHE_ALLIGN_LEN(size));
    int result = HAL_UART_Transmit_DMA(&huart7, txt, size);
    if(result==HAL_OK)
    {
    	ATOMIC_SET_BIT(huart7.Instance->CR1, USART_CR1_TCIE); 		/* Ręcznie upewniamy się, że przerwanie od zakończenia transmisji UART jest aktywne */
    }
    return result;
}

void DEBUG_ReceiveStart(uint8_t* buffer, uint16_t len)
{
	memset(buffer,0,len);														/* memset() takes 18us */
	SCB_CleanDCache_by_Addr((uint32_t*)buffer, CACHE_ALLIGN_LEN(len));			/* Wypchnij bufor RecvBuffer z casha do RAMu by wyczyscic pamiec DMA */
	UART_ClearFlags(&huart7);
	HAL_UART_Receive_DMA(&huart7,buffer,len);
	UART_ClearFlags2(&huart7);
}

void DEBUG_ReceiveStop(void){
	HAL_UART_DMAStop(&huart7);
}
/* USER CODE END 1 */
